{
  "backend/main.mo": "Main Motoko canister defining encouragement messages, user profiles, badges, and daily message logic with access control.",
  "feature_evidence.json": "Feature evidence report linking deployment-related files and components to a production publish feature.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files for reference.",
  "frontend/DEPLOYMENT.md": "Guide for deploying the app’s backend canister and frontend assets to production on the Internet Computer.",
  "frontend/index.css": "Defines global Tailwind CSS base styles and OKLCH color variables for both light and dark themes.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app in settings, auth, profile setup, and layout providers.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication guard that prompts users to sign in via Internet Identity before accessing the app.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting first‑time users to enter their name and creates an initial profile on save.",
  "frontend/src/components/branding/GeneratedAssets.ts": "Exports paths and alt text for generated mascot, badges, and background assets.",
  "frontend/src/components/feedback/GentleStates.tsx": "Reusable loading, empty, and error UI components with gentle visuals and optional retry actions.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout applying text‑size and reduced‑motion settings with a fixed background pattern.",
  "frontend/src/constants/routineCategories.ts": "Defines the four routine categories with names, descriptions, and themed Tailwind color classes.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, stored identity loading, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for fetching and mutating user profiles, messages, favorites, stats, and badges via the backend actor.",
  "frontend/src/hooks/useRewardFlow.ts": "Triggers a celebration flow and optional sound when the user hits message‑viewing milestones.",
  "frontend/src/index.css": "Global Tailwind styles with theming variables, text sizing classes, motion‑reduction support, and base UI adjustments.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/BadgeCelebrationScreen.tsx": "Displays an animated badge‑earned celebration with optional sound and navigation buttons.",
  "frontend/src/pages/BadgesScreen.tsx": "Shows user progress, earned badges, and handles loading/error states for stats and badge data.",
  "frontend/src/pages/EncouragementScreen.tsx": "Displays random encouragement messages with navigation, favorites, TTS, and sound effects, using multiple query hooks and user settings.",
  "frontend/src/pages/FavoritesScreen.tsx": "Shows the user's saved favorite messages with options to remove items and navigate home.",
  "frontend/src/pages/HomeScreen.tsx": "Provides the main landing page with navigation to encouragement, routine mode, favorites, settings, and logout.",
  "frontend/src/pages/RoutineModeScreen.tsx": "Lets users pick a routine category and cycle through related messages while updating stats and playing sounds.",
  "frontend/src/pages/SettingsScreen.tsx": "Allows users to configure text size, reduced motion, sounds, and TTS settings.",
  "frontend/src/state/SettingsContext.tsx": "Manages global app settings with localStorage persistence and exposes setters via React context.",
  "frontend/src/utils/sound.ts": "Implements simple click and success sound effects using the Web Audio API.",
  "frontend/src/utils/tts.ts": "Provides text‑to‑speech helpers with feature detection and speech control.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL params (including hash routing) and storing, retrieving, or clearing them in sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current state, features, and architectural notes for the motivation-focused children’s app."
}